Oryx-Embedded/CycloneCRYPTO/hardware/mimxrt1180/mimxrt1180_crypto_pkc.c
      //Perform RSAES-OAEP encryption
      status = ELE_GenericRsa(MU_APPS_S3MUA, &genericRsa);

      //Check status code
      if(status == kStatus_Success)
      {
         //Copy the resulting ciphertext
         osMemcpy(ciphertext, eleRsaArgs.c, (nLen + 7) / 8);
         //Return the length of the ciphertext
         *ciphertextLen = (nLen + 7) / 8;

         //Successful processing
         error = NO_ERROR;
      }
      else
      {
         //Report an error
         error = ERROR_FAILURE;
      }

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }
   else
   {
      //Report an error
      error = ERROR_INVALID_LENGTH;
   }

   //Return status code
   return error;
}


/**
 * @brief RSAES-OAEP decryption operation
 * @param[in] key Recipient's RSA private key
 * @param[in] hash Underlying hash function
 * @param[in] label Optional label to be associated with the message
 * @param[in] ciphertext Ciphertext to be decrypted
 * @param[in] ciphertextLen Length of the ciphertext to be decrypted
 * @param[out] message Output buffer where to store the decrypted message
 * @param[in] messageSize Size of the output buffer
 * @param[out] messageLen Length of the decrypted message
 * @return Error code
 **/

error_t rsaesOaepDecrypt(const RsaPrivateKey *key, const HashAlgo *hash,
   const char_t *label, const uint8_t *ciphertext, size_t ciphertextLen,
   uint8_t *message, size_t messageSize, size_t *messageLen)
{
   error_t error;
   size_t nLen;
   size_t dLen;
   size_t labelLen;
   status_t status;
   generic_rsa_algo_t algo;
   ele_generic_rsa_t genericRsa = {0};

   //Check parameters
   if(key == NULL || ciphertext == NULL)
      return ERROR_INVALID_PARAMETER;
   if(message == NULL || messageSize == 0 || messageLen == NULL)
      return ERROR_INVALID_PARAMETER;

   //Select the relevant algorithm
   if(osStrcmp(hash->name, "SHA-1") == 0)
   {
      algo = RSA_PKCS1_OAEP_SHA1;
   }
   else if(osStrcmp(hash->name, "SHA-224") == 0)
   {
      algo = RSA_PKCS1_OAEP_SHA224;
   }
   else if(osStrcmp(hash->name, "SHA-256") == 0)
   {
      algo = RSA_PKCS1_OAEP_SHA256;
   }
   else if(osStrcmp(hash->name, "SHA-384") == 0)
   {
      algo = RSA_PKCS1_OAEP_SHA384;
   }
   else if(osStrcmp(hash->name, "SHA-512") == 0)
   {
      algo = RSA_PKCS1_OAEP_SHA512;
   }
   else
   {
      return ERROR_UNSUPPORTED_HASH_ALGO;
   }

   //Get the length of the modulus, in bits
   nLen = mpiGetBitLength(&key->n);
   //Get the length of the private exponent, in bytes
   dLen = mpiGetByteLength(&key->d);

   //The accelerator supports operand lengths up to 4096 bits
   if(nLen <= 4096 && dLen <= 512 && ciphertextLen <= 512)
   {
      //Acquire exclusive access to the ELE module
      osAcquireMutex(&mimxrt1180CryptoMutex);

      //Copy the modulus
      mpiWriteRaw(&key->n, eleRsaArgs.n, (nLen + 7) / 8);
      //Copy the private exponent
      mpiWriteRaw(&key->d, eleRsaArgs.d, dLen);
      //Copy the ciphertext to be decrypted
      osMemcpy(eleRsaArgs.c, ciphertext, ciphertextLen);

      //The label is optional
      if(label != NULL)
      {
         osStrcpy(eleRsaArgs.label, label);
         labelLen = osStrlen(label);
      }
      else
      {
         labelLen = 0;
      }

      //Set RSA parameters
      genericRsa.algo = algo;
      genericRsa.mode = kDecryption;
      genericRsa.key_size = nLen;
      genericRsa.modulus = (uint32_t) eleRsaArgs.n;
      genericRsa.modulus_size = (nLen + 7) / 8;
      genericRsa.priv_exponent = (uint32_t) eleRsaArgs.d;
      genericRsa.priv_exponent_size = dLen;
      genericRsa.ciphertext = (uint32_t) eleRsaArgs.c;
      genericRsa.ciphertext_size = ciphertextLen;
      genericRsa.plaintext = (uint32_t) eleRsaArgs.m;
      genericRsa.plaintext_size = (nLen + 7) / 8;
      genericRsa.label = (uint32_t) eleRsaArgs.label;
      genericRsa.label_size = labelLen;
      genericRsa.flags = kFlagDigest;

      //Perform RSAES-OAEP decryption
      status = ELE_GenericRsa(MU_APPS_S3MUA, &genericRsa);

      //Check status code
      if(status == kStatus_Success)
      {
         //Check the length of the resulting plaintext
         if(genericRsa.out_plaintext_len <= messageSize)
         {
            //Copy the resulting message
            osMemcpy(message, eleRsaArgs.m, genericRsa.out_plaintext_len);
            //Return the length of the message
            *messageLen = genericRsa.out_plaintext_len;

            //Successful processing
            error = NO_ERROR;
         }
         else
         {
            //Report an error
            error = ERROR_BUFFER_OVERFLOW;
         }
      }
      else
      {
         //Report an error
         error = ERROR_FAILURE;
      }

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }
   else
   {
      //Report an error
      error = ERROR_INVALID_LENGTH;
   }

   //Return status code
   return error;
}


/**
 * @brief RSASSA-PKCS1-v1_5 signature generation operation
 * @param[in] key Signer's RSA private key
 * @param[in] hash Hash function used to digest the message
 * @param[in] digest Digest of the message to be signed
 * @param[out] signature Resulting signature
 * @param[out] signatureLen Length of the resulting signature
 * @return Error code
 **/

error_t rsassaPkcs1v15Sign(const RsaPrivateKey *key, const HashAlgo *hash,
   const uint8_t *digest, uint8_t *signature, size_t *signatureLen)
{
   error_t error;
   size_t nLen;
   size_t dLen;
   status_t status;
   generic_rsa_algo_t algo;
   ele_generic_rsa_t genericRsa = {0};

   //Check parameters
   if(key == NULL || hash == NULL || digest == NULL)
      return ERROR_INVALID_PARAMETER;
   if(signature == NULL || signatureLen == NULL)
      return ERROR_INVALID_PARAMETER;

   //Select the relevant algorithm
   if(osStrcmp(hash->name, "SHA-224") == 0)
   {
      algo = RSA_PKCS1_V1_5_SHA224_SIGN;
   }
   else if(osStrcmp(hash->name, "SHA-256") == 0)
   {
      algo = RSA_PKCS1_V1_5_SHA256_SIGN;
   }
   else if(osStrcmp(hash->name, "SHA-384") == 0)
   {
      algo = RSA_PKCS1_V1_5_SHA384_SIGN;
   }
   else if(osStrcmp(hash->name, "SHA-512") == 0)
   {
      algo = RSA_PKCS1_V1_5_SHA512_SIGN;
   }
   else
   {
      return ERROR_UNSUPPORTED_HASH_ALGO;
   }

