Oryx-Embedded/CycloneCRYPTO/hardware/mimxrt1180/mimxrt1180_crypto_pkc.c
   //Get the length of the modulus, in bits
   nLen = mpiGetBitLength(&key->n);
   //Get the length of the private exponent, in bytes
   dLen = mpiGetByteLength(&key->d);

   //The accelerator supports operand lengths up to 4096 bits
   if(nLen <= 4096 && dLen <= 512)
   {
      //Acquire exclusive access to the ELE module
      osAcquireMutex(&mimxrt1180CryptoMutex);

      //Copy the modulus
      mpiWriteRaw(&key->n, eleRsaArgs.n, (nLen + 7) / 8);
      //Copy the private exponent
      mpiWriteRaw(&key->d, eleRsaArgs.d, dLen);
      //Copy the digest of the message to be signed
      osMemcpy(eleRsaArgs.digest, digest, hash->digestSize);

      //Set RSA parameters
      genericRsa.algo = algo;
      genericRsa.mode = kSignGen;
      genericRsa.key_size = nLen;
      genericRsa.modulus = (uint32_t) eleRsaArgs.n;
      genericRsa.modulus_size = (nLen + 7) / 8;
      genericRsa.priv_exponent = (uint32_t) eleRsaArgs.d;
      genericRsa.priv_exponent_size = dLen;
      genericRsa.digest = (uint32_t) eleRsaArgs.digest;
      genericRsa.digest_size = hash->digestSize;
      genericRsa.signature = (uint32_t) eleRsaArgs.signature;
      genericRsa.signature_size = (nLen + 7) / 8;
      genericRsa.flags = kFlagDigest;

      //Perform RSASSA-PSS signature generation
      status = ELE_GenericRsa(MU_APPS_S3MUA, &genericRsa);

      //Check status code
      if(status == kStatus_Success)
      {
         //Copy the resulting message
         osMemcpy(signature, eleRsaArgs.signature, (nLen + 7) / 8);
         //Return the length of the message
         *signatureLen = (nLen + 7) / 8;

         //Successful processing
         error = NO_ERROR;
      }
      else
      {
         //Report an error
         error = ERROR_FAILURE;
      }

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }
   else
   {
      //Report an error
      error = ERROR_INVALID_LENGTH;
   }

   //Return status code
   return error;
}


/**
 * @brief RSASSA-PSS signature verification operation
 * @param[in] key Signer's RSA public key
 * @param[in] hash Hash function used to digest the message
 * @param[in] saltLen Length of the salt, in bytes
 * @param[in] digest Digest of the message whose signature is to be verified
 * @param[in] signature Signature to be verified
 * @param[in] signatureLen Length of the signature to be verified
 * @return Error code
 **/

error_t rsassaPssVerify(const RsaPublicKey *key, const HashAlgo *hash,
   size_t saltLen, const uint8_t *digest, const uint8_t *signature,
   size_t signatureLen)
{
   error_t error;
   size_t nLen;
   size_t eLen;
   status_t status;
   generic_rsa_algo_t algo;
   ele_generic_rsa_t genericRsa = {0};

   //Check parameters
   if(key == NULL || hash == NULL || digest == NULL || signature == NULL)
      return ERROR_INVALID_PARAMETER;

   //Select the relevant algorithm
   if(osStrcmp(hash->name, "SHA-224") == 0)
   {
      algo = RSA_PKCS1_PSS_MGF1_SHA224;
   }
   else if(osStrcmp(hash->name, "SHA-256") == 0)
   {
      algo = RSA_PKCS1_PSS_MGF1_SHA256;
   }
   else if(osStrcmp(hash->name, "SHA-384") == 0)
   {
      algo = RSA_PKCS1_PSS_MGF1_SHA384;
   }
   else if(osStrcmp(hash->name, "SHA-512") == 0)
   {
      algo = RSA_PKCS1_PSS_MGF1_SHA512;
   }
   else
   {
      return ERROR_UNSUPPORTED_HASH_ALGO;
   }

   //Get the length of the modulus, in bits
   nLen = mpiGetBitLength(&key->n);
   //Get the length of the public exponent, in bytes
   eLen = mpiGetByteLength(&key->e);

   //The accelerator supports operand lengths up to 4096 bits
   if(nLen <= 4096 && eLen <= 512 && signatureLen <= 512)
   {
      //Acquire exclusive access to the ELE module
      osAcquireMutex(&mimxrt1180CryptoMutex);

      //Copy the modulus
      mpiWriteRaw(&key->n, eleRsaArgs.n, (nLen + 7) / 8);
      //Copy the public exponent
      mpiWriteRaw(&key->e, eleRsaArgs.e, eLen);
      //Copy the digest of the message
      osMemcpy(eleRsaArgs.digest, digest, hash->digestSize);
      //Copy the signature to be verified
      osMemcpy(eleRsaArgs.signature, signature, signatureLen);

      //Set RSA parameters
      genericRsa.algo = algo;
      genericRsa.mode = kVerification;
      genericRsa.key_size = nLen;
      genericRsa.modulus = (uint32_t) eleRsaArgs.n;
      genericRsa.modulus_size = (nLen + 7) / 8;
      genericRsa.pub_exponent = (uint32_t) eleRsaArgs.e;
      genericRsa.pub_exponent_size = eLen;
      genericRsa.digest = (uint32_t) eleRsaArgs.digest;
      genericRsa.digest_size = hash->digestSize;
      genericRsa.signature = (uint32_t) eleRsaArgs.signature;
      genericRsa.signature_size = signatureLen;
      genericRsa.flags = kFlagDigest;

      //Perform RSASSA-PSS signature verification
      status = ELE_GenericRsa(MU_APPS_S3MUA, &genericRsa);

      //Check status code
      if(status == kStatus_Success)
      {
         //Valid RSA signature?
         if(genericRsa.verify_status == kVerifySuccess)
         {
            error = NO_ERROR;
         }
         else if(genericRsa.verify_status == kVerifyFailure)
         {
            error = ERROR_INVALID_SIGNATURE;
         }
         else
         {
            error = ERROR_FAILURE;
         }
      }
      else
      {
         //Report an error
         error = ERROR_FAILURE;
      }

      //Release exclusive access to the ELE module
      osReleaseMutex(&mimxrt1180CryptoMutex);
   }
   else
   {
      //Report an error
      error = ERROR_INVALID_LENGTH;
   }

   //Return status code
   return error;
}

#endif
#endif
